#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.ecr.data.aws_iam_policy_document.organization: Reading...[0m[0m
[0m[1mmodule.ecr.data.aws_iam_policy_document.organization: Read complete after 0s [id=1268496190][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.bucket.aws_s3_bucket.default[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "default" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "gimmedat"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "env"       = "dev"
          [32m+[0m[0m "project"   = "warnings"
          [32m+[0m[0m "region"    = "eu-north-1"
          [32m+[0m[0m "terraform" = "true"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # module.bucket.aws_s3_bucket_public_access_block.default[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "default" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.bucket.aws_s3_bucket_versioning.versioning[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "versioning" {
      [32m+[0m[0m bucket = "gimmedat"
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = (known after apply)
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1m  # module.ecr.aws_ecr_lifecycle_policy.lifecycle_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "lifecycle_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep last 2500 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 2500
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "gimmedat-recommender"
    }

[1m  # module.ecr.aws_ecr_repository.repository[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "repository" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = "gimmedat-recommender"
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name" = "gimmedat-recommender"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Name"      = "gimmedat-recommender"
          [32m+[0m[0m "env"       = "dev"
          [32m+[0m[0m "project"   = "warnings"
          [32m+[0m[0m "region"    = "eu-north-1"
          [32m+[0m[0m "terraform" = "true"
        }
    }

[1m  # module.ecr.aws_ecr_repository_policy.policy[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository_policy" "policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "ecr:UploadLayerPart",
                          [32m+[0m[0m "ecr:UntagResource",
                          [32m+[0m[0m "ecr:TagResource",
                          [32m+[0m[0m "ecr:StartImageScan",
                          [32m+[0m[0m "ecr:PutImageTagMutability",
                          [32m+[0m[0m "ecr:PutImageScanningConfiguration",
                          [32m+[0m[0m "ecr:PutImage",
                          [32m+[0m[0m "ecr:ListTagsForResource",
                          [32m+[0m[0m "ecr:ListImages",
                          [32m+[0m[0m "ecr:InitiateLayerUpload",
                          [32m+[0m[0m "ecr:GetRepositoryPolicy",
                          [32m+[0m[0m "ecr:GetLifecyclePolicy",
                          [32m+[0m[0m "ecr:GetDownloadUrlForLayer",
                          [32m+[0m[0m "ecr:GetAuthorizationToken",
                          [32m+[0m[0m "ecr:DescribeRepositories",
                          [32m+[0m[0m "ecr:DescribeImages",
                          [32m+[0m[0m "ecr:DescribeImageScanFindings",
                          [32m+[0m[0m "ecr:CreateRepository",
                          [32m+[0m[0m "ecr:CompleteLayerUpload",
                          [32m+[0m[0m "ecr:BatchGetImage",
                          [32m+[0m[0m "ecr:BatchCheckLayerAvailability",
                        ]
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "*"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "gimmedat-recommender"
    }

[1mPlan:[0m 6 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tf.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.out"

```

</details>

*Pusher: @westford14, Action: `pull_request`, Workflow: `Base CI Checks`*